recipes/pesto-and-sundried-tomato-quiche.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Pesto and Sundried Tomato Quiche</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content" class="content">
<h1 class="title">Pesto and Sundried Tomato Quiche</h1>
<p>
<a href="./pesto-and-sundried-tomato-quiche.html">The Vegan Home Baker by Georgia Irwin</a>
</p>
<div id="outline-container-org4a701bc" class="outline-2">
<h2 id="org4a701bc">Ingredients</h2>
<div class="outline-text-2" id="text-org4a701bc">
<ul class="org-ul">
<li>1 sheet puff pastry</li>
<li>2 tbsp olive oil</li>
<li>300g silken tofu</li>
<li>3 tbsp nutritional yeast</li>
<li>2 cloves garlic</li>
<li>1 tsp dijon mustard</li>
<li>1 tsp onion powder</li>
<li>1/2 tsp salt</li>
<li>1/2 tsp pepper</li>
<li>Basil pesto</li>
<li>50g chopped sundried tomatoes</li>
</ul>
</div>
</div>
<div id="outline-container-org8362178" class="outline-2">
<h2 id="org8362178">Instructions</h2>
<div class="outline-text-2" id="text-org8362178">
<ol class="org-ol">
<li>Preheat the oven to 180&deg;C</li>
<li>Grease of baking paper a 20cm tart tin</li>
<li>Drape pastry over tin and press down. Pierce the bottom with a fork. Place another sheet of baking paper and put a weight over before baking for 15 min</li>
<li>Remove weights and bake for another 5 min until slightly golden</li>
<li>For the filling, add oil, tofu, nutritional yeast, garlic, mustard, onion powder, salt, and pepper to the blender. Blend to smooth</li>
<li>Add the filling to the crust and top with pesto and sundried tomatoes</li>
<li>Bake for 35 minutes, remove and rest for 5 minutes</li>
</ol>
</div>
</div>
</div>
</body>
</html>
